JCL      TITLE '$JOBEXIT - JCL USER EXIT ROUTINE - VSE/ESA 1.2.0'
$JOBEXIT CSECT
         DC    CL8'JCLLUSEX'      IDENTIFIER OF USER EXIT LIST
         DC    CL8'$JOBEX00',CL8'STEPLOG '   DAVE C.
         DC    CL8'$JOBEX01',CL8'EXECSIZE'   CHRIS E.
         DC    XL4'FFFFFFFF'
         END
