   CATALOG HTTPLID.PROC   REPLACE=YES   DATA=YES
// EXEC   PGM=IDCAMS,SIZE=AUTO
   DELETE WIN.HTTP.TEMPLATE.ID.FILE                                   -
          CLUSTER  NOERASE  PURGE                                     -
          CATALOG(DAPSCO.DEVL.CATALOG)
   SET MAXCC = 0
   DEFINE CLUSTER( NAME('WIN.HTTP.TEMPLATE.ID.FILE')                  -
                   INDEXED                                            -
                   FREESPACE(0 0)                                     -
                   KEYS(13 0)                                         -
                   RECORDSIZE(121 121)                                -
                   NOREPLICATE                                        -
                   REUSE                                              -
                   SHAREOPTIONS(4 3)                                  -
                 )                                                    -
          DATA   ( NAME('WIN.HTTP.TEMPLATE.ID.DATA')                  -
                   CYLINDERS(1 1)                                     -
                   VOLUMES( IDD033 )                                  -
                   CISZ(8192)                                         -
                   SPEED                                              -
                 )                                                    -
          INDEX  ( NAME('WIN.HTTP.TEMPLATE.ID.INDEX')                 -
                   TRACKS(1 1)                                        -
                   VOLUMES( IDD033 )                                  -
                   CISZ(1024)                                         -
                 )                                                    -
          CATALOG(DAPSCO.DEVL.CATALOG)
   IF MAXCC > 4 THEN CANCEL JOB
/* EOD
/+
